INSERT INTO LINE (name, start_time, end_time, interval_time, bg_color)
VALUES
('1호선', '10:10', '10:20', 10, 'bg-gray-200'),
('2호선', '10:10', '10:20', 10, 'bg-red-500'),
('3호선', '10:10', '10:20', 10, 'bg-green-500'),
('4호선', '10:10', '10:20', 10, 'bg-orange-500'),
('5호선', '10:10', '10:20', 10, 'bg-purple-500'),
('6호선', '10:10', '10:20', 10, 'bg-yellow-500'),
('7호선', '10:10', '10:20', 10, 'bg-pink-500'),
('8호선', '10:10', '10:20', 10, 'bg-blue-500'),
('신분당선', '10:10', '10:20', 10, 'bg-blue-500');

INSERT INTO STATION(name)
VALUES
('선릉'),
('역삼'),
('강남'),
('양재'),
('양재시민의숲'),
('포비'),
('제이슨'),
('씨유'),
('준'),
('브라운'),
('워니');

INSERT into line_station (line, station_id, pre_station_id, duration, distance)
values
(2, 1, null, 10, 10),
(2, 2, 1, 10, 10),
(9, 10, null, 10, 10),
(9, 3, 2, 10, 10),
(9, 4, 3, 10, 10),
(9, 5, 4, 10, 10),
(1, 7, 6, 10, 5),
(1, 8, 7, 10, 2),
(3, 9, 8, 10, 2),
(3, 10, 9, 10, 2),
(3, 11, 10, 10, 5),
(4, 11, 7, 10, 5);
